/*
Вычислить площадь правильного шестиугольника со стороной а, используя подпрограмму вычисления площади треугольника.
Решение выполнить с использованием функции square_triangle(int a)
Спецификация:
-------------
* Назначение - вычисление площади правильного теугольника
* Вход - целочисленное значение стороны a
* Выход - вещественное значение площади треугольника

double square_triangle(int a)
{
	//...
}

*/


double square_triangle(int a)
{
        double result = 0;
        //...
        return result;
}


